code-review/NRB_3471_3546/База_Стало/DataProcessors/ВыгрузкаКотировокВBackQort.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаКотировокВBackQort</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационноАналитическиеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/КодыЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КодыЗагрузки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.МестаХранения</xr:Item>
				<xr:Item>Catalog.СчетаДепо</xr:Item>
				<xr:Item>Catalog.СчетаДепоМХ</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
				<xr:Item>Catalog.ЦенныеБумаги</xr:Item>
				<xr:Item>Catalog.ЮридическиеЛица</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.ГруппаЦБДляНалогообложения</xr:Item>
				<xr:Item>Catalog.ТипыНалогов</xr:Item>
				<xr:Item>Catalog.Субклиенты</xr:Item>
				<xr:Item>Catalog.ТарифныеПланы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыЗагрузки</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ВыгрузкаКотировокВBackQort/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура выгружает котировки ценных бумаг в BackQort
//
// Параметры:
//  УИДСообщенияПервогоЗапроса	 - Строка - Идентификатор первого исходного сообщения запроса
//  УИДСообщенияЗапроса			 - Строка - Идентификатор сообщения запроса
//  ТекстыОшибок				 - Массив - Коллекция для накапливания текстов об ошибках в процессе выгрузки
//
Процедура ВыгрузитьВBackQort(УИДСообщенияПервогоЗапроса = Неопределено, УИДСообщенияЗапроса = Неопределено,
	ТекстыОшибок = Неопределено) Экспорт
	
	ВыборкаКотировкиПоЦеннымБумагам = ВыборкаКотировкиПоЦеннымБумагам();
	
	ПараметрыВыгрузкиЦБ =
		Новый Структура("ВыборкаКотировкиПоЦеннымБумагам,УИДСообщенияПервогоЗапроса,УИДСообщенияЗапроса,ВсегоКВыгрузке,НомерВыгрузки");
	ПараметрыВыгрузкиЦБ.УИДСообщенияПервогоЗапроса = УИДСообщенияПервогоЗапроса;
	ПараметрыВыгрузкиЦБ.УИДСообщенияЗапроса = УИДСообщенияЗапроса;
	ПараметрыВыгрузкиЦБ.НомерВыгрузки = 0;
	ПараметрыВыгрузкиЦБ.ВсегоКВыгрузке = ВыборкаКотировкиПоЦеннымБумагам.Количество();
	
	ВыгруженоЦенныхБумаг = 0;
	Если ПараметрыВыгрузкиЦБ.ВсегоКВыгрузке > 0 Тогда
		ПараметрыВыгрузкиЦБ.ВыборкаКотировкиПоЦеннымБумагам = ВыборкаКотировкиПоЦеннымБумагам;
		Пока ВыборкаКотировкиПоЦеннымБумагам.Следующий() Цикл
			ПараметрыВыгрузкиЦБ.НомерВыгрузки = ВыгруженоЦенныхБумаг + 1;
			Успешно = ВыгрузитьКотировкуПоЦеннойБумаге(ПараметрыВыгрузкиЦБ, ТекстыОшибок);
			ВыгруженоЦенныхБумаг = ?(Успешно, ПараметрыВыгрузкиЦБ.НомерВыгрузки, ВыгруженоЦенныхБумаг);
		КонецЦикла;
	КонецЕсли;
	
	ЭтоВыгрузкаПоЗапросу = УИДСообщенияПервогоЗапроса <> Неопределено;
	Если ПараметрыВыгрузкиЦБ.ВсегоКВыгрузке = 0 И ЭтоВыгрузкаПоЗапросу Тогда
		ПараметрыВыгрузкиЦБ.ВыборкаКотировкиПоЦеннымБумагам = Неопределено;
		ВыгрузитьКотировкуПоЦеннойБумаге(ПараметрыВыгрузкиЦБ, ТекстыОшибок);
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон("Выгружено %1 ценных бумаг", ВыгруженоЦенныхБумаг);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгрузитьКотировкуПоЦеннойБумаге(ПараметрыВыгрузкиЦБ, ТекстыОшибок)
	
	Сущность = "SecuritiesQuotes";
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDepoToBqSecuritiesQuotes1642;
	УИДСообщения = Строка(Новый УникальныйИдентификатор);
	Успешно = Ложь;
	ЦеннаяБумага = ?(ПараметрыВыгрузкиЦБ.ВыборкаКотировкиПоЦеннымБумагам <> Неопределено,
		ПараметрыВыгрузкиЦБ.ВыборкаКотировкиПоЦеннымБумагам.ЦеннаяБумага, Неопределено);
	
	Попытка
		ТекстJSON = СформироватьJSON(УИДСообщения, Сущность, ПараметрыВыгрузкиЦБ);
		Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Сущность, ТекстJSON, УИДСообщения, ЦеннаяБумага);
		Успешно = Истина;
	Исключение
		Успешно = Ложь;
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Если ТипЗнч(ТекстыОшибок) = Тип("Массив") Тогда
			ТекстыОшибок.Добавить(ТекстОшибки);
		КонецЕсли;
	КонецПопытки;
	
	Возврат Успешно;
	
КонецФункции

Функция ТекстЗапросаКотировкиЦенныхБумаг()
	Возврат
	"ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
	|	ЦенныеБумаги.ТипЦБ КАК ТипЦБ,
	|	Котировки.Период КАК Date,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК RegNum,
	|	ЕСТЬNULL(КодыЗагрузкиЦБ.Код, """") КАК AssetCode,
	|	ВЫБОР
	|		КОГДА Котировки.LegalClosePrice <> 0
	|			ТОГДА Котировки.LegalClosePrice
	|		ИНАЧЕ Котировки.last_price
	|	КОНЕЦ КАК Close,
	|	Котировки.Bid КАК Bid,
	|	Котировки.Offer КАК Ask,
	|	Котировки.WAPrice КАК Avg,
	|	Котировки.indicative_price КАК IndicativePrice,
	|	Котировки.AccInt КАК AccInt,
	|	ВЫБОР
	|		КОГДА Котировки.ВалютаКотировки = &Рубль
	|			ТОГДА ""RUB""
	|		ИНАЧЕ Котировки.ВалютаКотировки.Наименование
	|	КОНЕЦ КАК Currency,
	|	ВЫБОР
	|		КОГДА Котировки.Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.CBonds)
	|			ТОГДА ""CBONDS""
	|		КОГДА Котировки.Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.НРД)
	|			ТОГДА ""NSD""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК SourceAPI,
	|	ИсточникиКотировок.Код КАК TradingGroundCode,
	|	ИсточникиКотировок.ПолноеНаименование КАК TradingGroundName,
	|	Котировки.ЭтоКотировкаОсновногоИсточника КАК IsPrimaryExchange
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО Котировки.ЦеннаяБумага = ЦенныеБумаги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиЦБ
	|		ПО (ЦенныеБумаги.Ссылка = КодыЗагрузкиЦБ.Владелец)
	|			И (НЕ КодыЗагрузкиЦБ.ПометкаУдаления)
	|			И (КодыЗагрузкиЦБ.Биржа = &НДЦ)
	|			И (КодыЗагрузкиЦБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиЦБ.ДатаОкончанияДействия > &ТекущаяДата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиКотировок КАК ИсточникиКотировок
	|		ПО Котировки.ИсточникКотировок = ИсточникиКотировок.Ссылка
	|{ГДЕ
	|	Котировки.Период КАК Период,
	|	Котировки.Биржа КАК Биржа,
	|	ЦенныеБумаги.Ссылка КАК ЦенныеБумаги}
	|ИТОГИ ПО
	|	ЦеннаяБумага";
КонецФункции

Функция ВыборкаКотировкиПоЦеннымБумагам()
	ТекстЗапроса = ТекстЗапросаКотировкиЦенныхБумаг();
	ПостроительЗапроса = Новый ПостроительЗапроса(ТекстЗапроса);
	ПостроительЗапроса.ЗаполнитьНастройки();
	ПостроительЗапроса.Параметры.Вставить("НДЦ", Справочники.КлассификаторыЗагрузки.NrdCode);
	ПостроительЗапроса.Параметры.Вставить("ТекущаяДата", ТекущаяДатаСеанса());
	ПостроительЗапроса.Параметры.Вставить("Рубль", Справочники.Валюты.Рубль());
	Отбор = ПостроительЗапроса.Отбор;
	
	Отбор.Добавить("Период");
	Отбор.Период.ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
	Отбор.Период.Использование = Истина;
	Отбор.Период.ЗначениеС = НачалоПериода;
	Отбор.Период.ЗначениеПо = КонецПериода;
	
	Отбор.Добавить("Биржа");
	Отбор.Биржа.Использование = Истина;
	Отбор.Биржа.ВидСравнения = ВидСравнения.ВСписке;
	СписокБирж = Новый СписокЗначений;
	Если ЗначениеЗаполнено(Биржа) Тогда
		СписокБирж.Добавить(Биржа);
	Иначе
		ИсточникиКотировок = Обработки.ВыгрузкаКотировокВBackQort.ВыгружаемыеИсточникиКотировок();
		СписокБирж.ЗагрузитьЗначения(ИсточникиКотировок);
	КонецЕсли;
	Отбор.Биржа.Значение = СписокБирж;
	
	Если ЗначениеЗаполнено(ЦенныеБумаги) Тогда
		Отбор.Добавить("ЦенныеБумаги");
		Отбор.ЦенныеБумаги.ВидСравнения = ВидСравнения.ВСписке;
		Отбор.ЦенныеБумаги.Использование = Истина;
		СписокЦенныхБумаг = Новый СписокЗначений;
		СписокЦенныхБумаг.ЗагрузитьЗначения(ЦенныеБумаги.Выгрузить(, "ЦеннаяБумага").ВыгрузитьКолонку("ЦеннаяБумага"));
		Отбор.ЦенныеБумаги.Значение = СписокЦенныхБумаг;
	КонецЕсли;
	
	ПостроительЗапроса.Выполнить();
	ВыборкаКотировкиПоЦеннымБумагам = ПостроительЗапроса.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат ВыборкаКотировкиПоЦеннымБумагам;
КонецФункции

#Область Kafka

Функция СформироватьJSON(УИДСообщения, Сущность, ПараметрыВыгрузкиЦБ)
	
	MessageInfo = ОбменДаннымиКафка.ТиповыеДанныеMessageInfo(Сущность, "INS", "1.0.1", УИДСообщения);
	MessageInfo.MasterMessageId = ?(ЗначениеЗаполнено(ПараметрыВыгрузкиЦБ.УИДСообщенияПервогоЗапроса),
		ПараметрыВыгрузкиЦБ.УИДСообщенияПервогоЗапроса, УИДСообщения);
	MessageInfo.ParentMessageId = ПараметрыВыгрузкиЦБ.УИДСообщенияЗапроса;
	
	Data = ДанныеData(ПараметрыВыгрузкиЦБ, Сущность);
	
	ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Возврат ТекстJSON;
	
КонецФункции

Функция ДанныеData(ПараметрыВыгрузкиЦБ, Сущность)
	
	ДанныеПоЦеннымБумагам = Новый Массив;
	
	Если ПараметрыВыгрузкиЦБ.ВыборкаКотировкиПоЦеннымБумагам <> Неопределено Тогда
		ВыборкаДетальныеЗаписи = ПараметрыВыгрузкиЦБ.ВыборкаКотировкиПоЦеннымБумагам.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
			Date = ЗаписатьДатуJSON(ВыборкаДетальныеЗаписи.Date, ФорматДатыJSON.ISO);
			Если ВыборкаДетальныеЗаписи.ТипЦБ = Перечисления.ТипыЦБ.Облигация Тогда
				IsPrimaryExchange = Неопределено;
			Иначе
				IsPrimaryExchange = ВыборкаДетальныеЗаписи.IsPrimaryExchange;
			КонецЕсли;
			
			Asset = Новый Структура;
			Asset.Вставить("Isin", ВыборкаДетальныеЗаписи.Isin);
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(Asset, "AssetCode", СокрЛП(ВыборкаДетальныеЗаписи.AssetCode));
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(Asset, "RegNum", ВыборкаДетальныеЗаписи.RegNum);

			ДанныеПоЦеннойБумаге = Новый Структура;
			ДанныеПоЦеннойБумаге.Вставить("Date", Date);
			ДанныеПоЦеннойБумаге.Вставить("Asset", Asset);
			
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(ДанныеПоЦеннойБумаге, "Close", ВыборкаДетальныеЗаписи.Close);
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(ДанныеПоЦеннойБумаге, "Bid", ВыборкаДетальныеЗаписи.Bid);
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(ДанныеПоЦеннойБумаге, "Ask", ВыборкаДетальныеЗаписи.Ask);
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(ДанныеПоЦеннойБумаге, "Avg", ВыборкаДетальныеЗаписи.Avg);
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(ДанныеПоЦеннойБумаге, "IndicativePrice", ВыборкаДетальныеЗаписи.IndicativePrice);
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(ДанныеПоЦеннойБумаге, "AccInt", ВыборкаДетальныеЗаписи.AccInt);
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(ДанныеПоЦеннойБумаге, "Currency", ВыборкаДетальныеЗаписи.Currency);
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(ДанныеПоЦеннойБумаге, "SourceAPI", ВыборкаДетальныеЗаписи.SourceAPI);
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(ДанныеПоЦеннойБумаге, "TradingGroundCode", ВыборкаДетальныеЗаписи.TradingGroundCode);
			РаботаСJSON.ДобавитьВСтруктуруНеобязательноеПоле(ДанныеПоЦеннойБумаге, "TradingGroundName", ВыборкаДетальныеЗаписи.TradingGroundName);
			ДанныеПоЦеннойБумаге.Вставить("IsPrimaryExchange", IsPrimaryExchange);
			
			ДанныеПоЦеннымБумагам.Добавить(ДанныеПоЦеннойБумаге);
			
		КонецЦикла;
	КонецЕсли;
	
	ДанныеКОтправке = Новый Структура;
	ДанныеКОтправке.Вставить(Сущность, ДанныеПоЦеннымБумагам);
	ДанныеКОтправке.Вставить("AssetNumber", ПараметрыВыгрузкиЦБ.НомерВыгрузки);
	ДанныеКОтправке.Вставить("AssetCount", ПараметрыВыгрузкиЦБ.ВсегоКВыгрузке);
	
	Возврат ДанныеКОтправке;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Инициализация

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);

#КонецОбласти
